InformationRegisters/ОтветственныеЗаОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЗаОперации</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаВидовОпераций</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыВидовОпераций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОтветственныеЗаОперации/Ext/RecordSetModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		Если ЗначениеЗаполнено(СтрокаНабора.ДатаОкончания) И СтрокаНабора.ДатаОкончания < СтрокаНабора.Период Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата начала должна быть меньше или равна дате окончания", ЭтотОбъект, "Запись.ДатаНачала", , Отказ);	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Справочники.Сотрудники.ПроверитьНаличиеПользователяУСотрудников(ЭтотОбъект, "Сотрудник", Отказ);
	
	Справочники.Сотрудники.ПроверитьОтветственныхНаУвольнение(ЭтотОбъект, Отказ);	
	
	ПроверитьКорректностьДанных(Отказ);
	
КонецПроцедуры

// Проверка результирующего набора:
// 1. основной ответственный должен быть только один
// 2. записи не пересекаются сами с собой
// 3. при наличии ответственных один из них должен быть основной
// 4. замещать может только сотрудник из ответственных
// 
Функция ПроверитьКорректностьДанных(Отказ)
	
	РезультатПроверки = Истина;	
	
	// Если удаление предшествует записи нового набора, то проверку не выполняем 
	Если ЭтотОбъект.ДополнительныеСвойства.УдалениеВСоставеИзмененияНабора Тогда
		Возврат РезультатПроверки;	
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОтветственныеНовогоНабора.Организация КАК Организация,
		|	_ОтветственныеНовогоНабора.ГруппаВидовОпераций КАК ГруппаВидовОпераций
		|ПОМЕСТИТЬ _ОтветственныеНовогоНабора
		|ИЗ
		|	&ОтветственныеНовогоНабора КАК _ОтветственныеНовогоНабора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтветственныеЗаОперации.Организация КАК Организация,
		|	ОтветственныеЗаОперации.ГруппаВидовОпераций КАК ГруппаВидовОпераций,
		|	ОтветственныеЗаОперации.Сотрудник КАК Сотрудник,
		|	ОтветственныеЗаОперации.Сотрудник.ВидЗанятости КАК ВидЗанятости,
		|	""Основные ответственные по группе видов операций пересекаются по времени: "" КАК ВидПересечения
		|ИЗ
		|	РегистрСведений.ОтветственныеЗаОперации КАК ОтветственныеЗаОперации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыВидовОпераций КАК ГруппыВидовОпераций
		|		ПО ОтветственныеЗаОперации.ГруппаВидовОпераций = ГруппыВидовОпераций.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ОтветственныеНовогоНабора КАК _ОтветственныеНовогоНабора
		|		ПО (_ОтветственныеНовогоНабора.Организация = ОтветственныеЗаОперации.Организация)
		|			И (_ОтветственныеНовогоНабора.ГруппаВидовОпераций = ОтветственныеЗаОперации.ГруппаВидовОпераций)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЗаОперации КАК ПересекающиесяОсновныеОтветственные
		|		ПО (ПересекающиесяОсновныеОтветственные.Организация = ОтветственныеЗаОперации.Организация)
		|			И (ПересекающиесяОсновныеОтветственные.ГруппаВидовОпераций = ОтветственныеЗаОперации.ГруппаВидовОпераций)
		|			И (ПересекающиесяОсновныеОтветственные.Сотрудник <> ОтветственныеЗаОперации.Сотрудник)
		|			И (ПересекающиесяОсновныеОтветственные.Основной)
		|			И (ПересекающиесяОсновныеОтветственные.Период <= ОтветственныеЗаОперации.ДатаОкончания
		|				ИЛИ ОтветственныеЗаОперации.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|			И (ОтветственныеЗаОперации.Период <= ПересекающиесяОсновныеОтветственные.ДатаОкончания
		|				ИЛИ ПересекающиесяОсновныеОтветственные.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|ГДЕ
		|	ОтветственныеЗаОперации.Основной
		|	И НЕ &УдалениеЗаписей
		|	И ГруппыВидовОпераций.Родитель <> ЗНАЧЕНИЕ(Справочник.ГруппыВидовОпераций.ОтчетностьЦБ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОтветственныеЗаОперации.Организация КАК Организация,
		|	ОтветственныеЗаОперации.ГруппаВидовОпераций КАК ГруппаВидовОпераций,
		|	ОтветственныеЗаОперации.Сотрудник КАК Сотрудник,
		|	ОтветственныеЗаОперации.Сотрудник.ВидЗанятости КАК ВидЗанятости,
		|	""Ответственные по группе видов операций пересекаются по времени: "" КАК ВидПересечения
		|ИЗ
		|	РегистрСведений.ОтветственныеЗаОперации КАК ОтветственныеЗаОперации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыВидовОпераций КАК ГруппыВидовОпераций
		|		ПО ОтветственныеЗаОперации.ГруппаВидовОпераций = ГруппыВидовОпераций.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ОтветственныеНовогоНабора КАК _ОтветственныеНовогоНабора
		|		ПО (_ОтветственныеНовогоНабора.Организация = ОтветственныеЗаОперации.Организация)
		|			И (_ОтветственныеНовогоНабора.ГруппаВидовОпераций = ОтветственныеЗаОперации.ГруппаВидовОпераций)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЗаОперации КАК ПересекающиесяОсновныеОтветственные
		|		ПО (ПересекающиесяОсновныеОтветственные.Организация = ОтветственныеЗаОперации.Организация)
		|			И (ПересекающиесяОсновныеОтветственные.ГруппаВидовОпераций = ОтветственныеЗаОперации.ГруппаВидовОпераций)
		|			И (ПересекающиесяОсновныеОтветственные.Сотрудник <> ОтветственныеЗаОперации.Сотрудник)
		|			И (ПересекающиесяОсновныеОтветственные.Период <= ОтветственныеЗаОперации.ДатаОкончания
		|				ИЛИ ОтветственныеЗаОперации.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|			И (ОтветственныеЗаОперации.Период <= ПересекающиесяОсновныеОтветственные.ДатаОкончания
		|				ИЛИ ПересекающиесяОсновныеОтветственные.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|ГДЕ
		|	НЕ &УдалениеЗаписей
		|	И ГруппыВидовОпераций.Родитель = ЗНАЧЕНИЕ(Справочник.ГруппыВидовОпераций.ОтчетностьЦБ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОтветственныеЗаОперации.Организация,
		|	ОтветственныеЗаОперации.ГруппаВидовОпераций,
		|	ОтветственныеЗаОперации.Сотрудник,
		|	ОтветственныеЗаОперации.Сотрудник.ВидЗанятости,
		|	""Ответственные пересекаются по времени: ""
		|ИЗ
		|	РегистрСведений.ОтветственныеЗаОперации КАК ОтветственныеЗаОперации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ОтветственныеНовогоНабора КАК _ОтветственныеНовогоНабора
		|		ПО (_ОтветственныеНовогоНабора.Организация = ОтветственныеЗаОперации.Организация)
		|			И (_ОтветственныеНовогоНабора.ГруппаВидовОпераций = ОтветственныеЗаОперации.ГруппаВидовОпераций)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЗаОперации КАК ПересекающиесяОтветственные
		|		ПО (ПересекающиесяОтветственные.Организация = ОтветственныеЗаОперации.Организация)
		|			И (ПересекающиесяОтветственные.ГруппаВидовОпераций = ОтветственныеЗаОперации.ГруппаВидовОпераций)
		|			И (ПересекающиесяОтветственные.Сотрудник.ЮрФизЛицо = ОтветственныеЗаОперации.Сотрудник.ЮрФизЛицо)
		|			И (ПересекающиесяОтветственные.Сотрудник <> ОтветственныеЗаОперации.Сотрудник
		|				ИЛИ ПересекающиесяОтветственные.Период <> ОтветственныеЗаОперации.Период)
		|			И (ПересекающиесяОтветственные.Период <= ОтветственныеЗаОперации.ДатаОкончания
		|				ИЛИ ОтветственныеЗаОперации.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|			И (ОтветственныеЗаОперации.Период <= ПересекающиесяОтветственные.ДатаОкончания
		|				ИЛИ ПересекающиесяОтветственные.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|ГДЕ
		|	НЕ &УдалениеЗаписей
		|ИТОГИ ПО
		|	ВидПересечения,
		|	ГруппаВидовОпераций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ОтветственныеЗаОперации.Организация КАК Организация,
		|	ОтветственныеЗаОперации.ГруппаВидовОпераций КАК ГруппаВидовОпераций,
		|	ОтветственныеЗаОперации.Период КАК ДатаНачала,
		|	ОтветственныеЗаОперации.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	РегистрСведений.ОтветственныеЗаОперации КАК ОтветственныеЗаОперации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыВидовОпераций КАК ГруппыВидовОпераций
		|		ПО ОтветственныеЗаОперации.ГруппаВидовОпераций = ГруппыВидовОпераций.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЗаОперации КАК ОсновныеОтветственные
		|		ПО (ОсновныеОтветственные.Организация = ОтветственныеЗаОперации.Организация)
		|			И (ОсновныеОтветственные.ГруппаВидовОпераций = ОтветственныеЗаОперации.ГруппаВидовОпераций)
		|			И (ОсновныеОтветственные.Основной)
		|			И (ОсновныеОтветственные.Период <= ОтветственныеЗаОперации.ДатаОкончания
		|				ИЛИ ОтветственныеЗаОперации.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|			И (ОтветственныеЗаОперации.Период <= ОсновныеОтветственные.ДатаОкончания
		|				ИЛИ ОсновныеОтветственные.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|ГДЕ
		|	ОсновныеОтветственные.Сотрудник ЕСТЬ NULL
		|	И НЕ &ЗаменаОсновогоОтветственного
		|	И ГруппыВидовОпераций.Родитель <> ЗНАЧЕНИЕ(Справочник.ГруппыВидовОпераций.ОтчетностьЦБ)
		|ИТОГИ ПО
		|	ГруппаВидовОпераций");

	Запрос.УстановитьПараметр("ОтветственныеНовогоНабора", ЭтотОбъект.Выгрузить(, "Организация, ГруппаВидовОпераций"));	
	Запрос.УстановитьПараметр("УдалениеЗаписей", (ЭтотОбъект.Количество() = 0));
	Запрос.УстановитьПараметр("ЗаменаОсновогоОтветственного", ЭтотОБъект.ДополнительныеСвойства.Свойство("ЗаменаОсновогоОтветственного"));
	
	РезультатПакета = Запрос.ВыполнитьПакет();

	// Проверка пересечений
	
	Если Не РезультатПакета[1].Пустой() Тогда
		
		РезультатПроверки = Ложь;
		
		ВыборкаПоВидуПересечений = РезультатПакета[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоВидуПересечений.Следующий() Цикл
			
			МассивПересечений = Новый Массив;
			
			ВыборкаПоГруппеВидовОпераций = ВыборкаПоВидуПересечений.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоГруппеВидовОпераций.Следующий() Цикл
				МассивОтветственных = Новый Массив;
				
				ВыборкаПоОтветственным = ВыборкаПоГруппеВидовОпераций.Выбрать(ОбходРезультатаЗапроса.Прямой);
				Пока ВыборкаПоОтветственным.Следующий() Цикл
					МассивОтветственных.Добавить(СтрШаблон("%1 (%2)", ВыборкаПоОтветственным.Сотрудник, ВыборкаПоОтветственным.ВидЗанятости));						
				КонецЦикла;
				
				МассивПересечений.Добавить(Строка(ВыборкаПоГруппеВидовОпераций.ГруппаВидовОпераций) + " (" + СтрСоединить(МассивОтветственных, ", ") + ")");	
			КонецЦикла;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ВыборкаПоВидуПересечений.ВидПересечения + СтрСоединить(МассивПересечений, ", "), , , , Отказ);
			
		КонецЦикла;

	КонецЕсли;	

	// Проверка основных ответственных
	
	Если Не РезультатПакета[2].Пустой() Тогда
	
		РезультатПроверки	= Ложь;
		МассивОшибок		= Новый Массив;
			
		ВыборкаПоГруппеВидовОпераций = РезультатПакета[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоГруппеВидовОпераций.Следующий() Цикл
			МассивПериодов = Новый Массив;
			
			ВыборкаПоПериодам = ВыборкаПоГруппеВидовОпераций.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Пока ВыборкаПоПериодам.Следующий() Цикл
				МассивПериодов.Добавить(Формат(ВыборкаПоПериодам.ДатаНачала, "ДФ=dd.MM.yyyy") + Формат(ВыборкаПоПериодам.ДатаОкончания, "ДФ=' - dd.MM.yyyy'; ДП=' и далее'"));						
			КонецЦикла;
			
			МассивОшибок.Добавить(Строка(ВыборкаПоГруппеВидовОпераций.ГруппаВидовОпераций) + " (" + СтрСоединить(МассивПериодов, ", ") + ")");	
		КонецЦикла;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен основной Сотрудник: " + СтрСоединить(МассивОшибок, ", "), , , , Отказ);	
		
	КонецЕсли;	
	
	// Замещать может только человек из ответственных
	
	ОтборЗамещающих = Новый Структура;
	
	Если ЭтотОбъект.Отбор.Организация.Использование Тогда
		ОтборЗамещающих.Вставить("Организация", ЭтотОбъект.Отбор.Организация.Значение);
	КонецЕсли;	
	
	Если ЭтотОбъект.Отбор.ГруппаВидовОпераций.Использование Тогда
		ОтборЗамещающих.Вставить("ГруппаВидовОпераций", ЭтотОбъект.Отбор.ГруппаВидовОпераций.Значение);
	КонецЕсли;	
	
	Если ЭтотОбъект.Отбор.Сотрудник.Использование Тогда
		ОтборЗамещающих.Вставить("Замещающий", ЭтотОбъект.Отбор.Сотрудник.Значение);
	КонецЕсли; 
	
	Если Не РегистрыСведений.ЗамещающиеСотрудники.ПроверитьЗамещающихНаВхождениеВСпискиОтветственныхЗаОперации(ОтборЗамещающих, Отказ) Тогда
		РезультатПроверки = Ложь;
	КонецЕсли;
	
	Возврат РезультатПроверки;

КонецФункции
